app/controllers/users_controller.rb

  def create
    only_admin
    @user = User.new(params[:user])
    if params[:groups]
      params[:groups].each do |id|
        @user.groups << Group.find(id)
---
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', '37ae79ae8fbfe3cf85f95bf3101369e863c7e26e', '2010-03-16 17:15:38', '4153badf2b51399a66d6bb8f0e595a1fae4ca7d7', NULL, '2010-03-16 17:15:38', NULL, 'krica', 'krica@gravastar.cz')

  def show
    only_admin
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1